In [54]:
import pandas as pd
import numpy as np

In [55]:
ml_csv = r"/Users/micha/git/training/ratings_2.csv"

In [56]:
df = pd.read_csv(ml_csv)
df.head()

   userId  movieId  rating  timestamp
0     196      242       3  881250949
1     186      302       3  891717742
2      22      377       1  878887116
3     244       51       2  880606923
4     166      346       1  886397596

Now we'll remove the column timestamp from the dataset.

In [57]:
df = df.drop('timestamp', axis=1)
df.head()

   userId  movieId  rating
0     196      242       3
1     186      302       3
2      22      377       1
3     244       51       2
4     166      346       1

In [58]:
tables = {
    'movielens': df
}

In [59]:
metadata = {
    "tables": [
        {
            "fields": [
                               
                {
                    "name": "userId",
                    "type": "numerical",
                    "subtype": "integer",
                },
                {
                    "name": "movieId",
                    "type": "numerical",
                    "subtype": "integer",
        
                },
                {
                    "name": "rating",
                    "type": "numerical",
                    "subtype": "integer",
                },
                
#                 {
#                     "name": "timestamp",
#                     "type": "numerical",
#                     "subtype": "integer",
#                 },
            ],
            "name": "movielens",
        }
    ]
}

In [60]:
from sdv import SDV

sdv = SDV()
sdv.fit(metadata, tables)

In [61]:
sampled = sdv.sample('movielens', num_rows=len(df))
sampled['movielens'].head(10)

   userId  movieId  rating
0     653       30       3
1     762      699       5
2     -26     1016       5
3     580      110       4
4     703      599       4
5     914      334       4
6     247       -8       5
7     613      541       4
8     550       54       4
9     413      135       4

Remove Negative values

In [62]:
cols = ['userId', 'movieId', 'rating']
sampled['movielens'] = sampled['movielens'][sampled['movielens'][cols] > 0]
sampled['movielens'].head()

   userId  movieId  rating
0   653.0     30.0     3.0
1   762.0    699.0     5.0
2     NaN   1016.0     5.0
3   580.0    110.0     4.0
4   703.0    599.0     4.0

Drop these (previously negative numbers) Nan values.

In [63]:
sampled['movielens'] = sampled['movielens'].dropna()
sampled['movielens'].head()

   userId  movieId  rating
0   653.0     30.0     3.0
1   762.0    699.0     5.0
3   580.0    110.0     4.0
4   703.0    599.0     4.0
5   914.0    334.0     4.0

Reset the index the rows

In [64]:
sampled['movielens'].reset_index(drop=True,inplace=True)
sampled['movielens'].tail()

       userId  movieId  rating
85993  1083.0     43.0     3.0
85994   355.0   1482.0     4.0
85995   353.0    326.0     3.0
85996   403.0    298.0     4.0
85997   543.0    339.0     3.0

In [67]:
sampled['movielens'].shape

(85998, 3)

In [65]:
from sdv.evaluation import evaluate

samples = sdv.sample_all(len(tables['movielens']))

evaluate(samples, real=tables, metadata=sdv.metadata)

        mse  r2_score     rmse
0  0.650539   0.99998  0.80656